{ "results": [
	{
        "createdAt": "2015-08-07T18:39:58.459Z",
        "objectId": "jpFm0ggq8t",
        "text": "Some high-profile Spotify users say they have left the music service over changes in its terms and conditions.\n\nThe streaming platform now wants access to pictures, contact phone numbers and sensor data stored on the user's smartphone as well as permission to view social media activity.\n\nMinecraft creator Markus Persson, aka Notch, tweeted to his 2.4m followers that he has cancelled his account.\n\nSpotify said the changes would help it \"tailor improved user experience\".\n\nSensor data, such as how fast the user's phone is moving, helped the Swedish firm develop Spotify Running, a new feature that tailors music playlists to physical activity.\n\n\"Spotify is constantly innovating and evolving its service to deliver the best possible experience for our users. This means delivering the perfect recommendations for every moment, and helping you to enjoy, discover and share more music than ever before,\" Spotify said in a statement.\n\n\"Throughout, the privacy and security of our customers' data is - and will remain - Spotify's highest priority.\n\n\"We will always ask for individual permission or clearly inform you of the ability to opt out from sharing location, photos, voice and contacts.\"\n\nThe firm has 75 million active users and 20 million subscribers in 58 countries, according to its own figures.\n\nThe terms and conditions also state that it is up to the user to ensure that people listed in the contacts list on their handset are happy for their phone number to be shared with the music platform.\n\n\"Local law may require that you seek the consent of your contacts to provide their personal information to Spotify, which may use that information for the purposes specified in this privacy policy,\" reads the update.\n'Jealous ex'\n\nThere has been some angry reaction to the changes.\n\n\"Like a jealous ex, Spotify wants to see (and collect) your photos and see who you're talking to,\" wrote Wired magazine.\n\n\"I'm now considering whether the £10 I pay for a premium membership is worth it, given the amount of privacy I'd be giving away by consenting,\" wrote Forbes reporter Thomas Fox-Brewster.\n\nMarkus Persson tweeted the company direct.\n\n\"As a consumer, I've always loved your service. You're the reason I stopped pirating music. Please consider not being evil,\" he wrote.\n\nIn a blogpost, Spotify said its new terms were updated in the interests of transparency.\n\n\"We want to be as open and transparent as possible when it comes to how we describe our business, how we work with advertisers, what information we collect, and what we do with it,\" the post said.\n\n\"We also want to make sure our terms are up-to-date with all the latest features we are offering.\"",
        "updatedAt": "2015-08-21T16:00:06.400Z"
    },
	{
        "createdAt": "2015-08-07T18:40:10.278Z",
        "objectId": "opi61Cx5YL",
        "text": "Google has been ordered to remove nine links to news stories by the UK's Information Commissioner's Office (ICO) under the \"right to be forgotten\".\n\nDetails of a \"minor criminal offence\" were referenced in the stories regarding an individual, the ICO said.\n\nEarlier links about the case had already been removed - but this act of removal itself later became news.\n\nIt is the links to those new articles, when searched for via the individual's name, which must now be removed.\n\nIn a statement, the ICO revealed that Google had refused to remove the links when asked by the complainant, which is why officials are now stepping in.\n\nBeing able to access the links by searching for the complainant by name constitutes a breach of the Data Protection Act, according to the ICO.\n\n\"Let's be clear. We understand that links being removed as a result of this court ruling is something that newspapers want to write about,\" said deputy commissioner David Smith.\n\n\"And we understand that people need to be able to find these stories through search engines like Google.\n\n\"But that does not need them to be revealed when searching on the original complainant's name.\"\n\nThe ICO says that Google must remove the links within 35 days of the order, dated 18 August.\n\nGoogle has so far declined to comment.\nMessy compromise\n\nThe situation was described as a \"messy compromise\" by Ian Walden, professor of information and communications law at Queen Mary, University of London.\n\n\"You can search under 'right to be forgotten', 'takedown', and you can look at the whole discussion about whether it's being taken down,\" he told the BBC, \"but if you search the individual's name you should get a different set of search results.\"\n\nDr Walden added that as the complexity of removal requests grows, it's possible that search engines like Google may become less willing to challenge them.\n\n\"In five years' time perhaps Google will say, 'It's not worth the hassle, let's take down more stuff, let's not spend as much time evaluating the case,' - they obviously have to employ people for this,\" he said.\n\n\"My concern is it [will become] easier and easier to get stuff taken down when in fact there continues to be a balancing act that needs to be carried out,\" he said.",
        "updatedAt": "2015-08-21T16:03:33.768Z"
    },
	{
        "createdAt": "2015-08-07T18:40:21.233Z",
        "objectId": "CuTnZRTPO8",
        "text": "A lot of data has been released about Ashley Madison but some facts of the breach of the dating website's database remain stubbornly elusive, not least who are the hackers behind the attack?\n\nThey call themselves the Impact Team and seem to have formed solely to carry out the attack on the infidelity website. There is no evidence of the group stealing data elsewhere before it announced itself with the Ashley Madison attack on 15 July.\n\nComments made by Noel Biderman, chief executive of Avid Life Media, which owns Ashley Madison, soon after the hack became public suggested it knew the identity of at least one of the people involved.\n\n\"It was definitely a person here that was not an employee but certainly had touched our technical services,\" he told security blogger Brian Krebs.\nStronger skill set\n\nSince then, little new information has been made public about the hack, leading some to assume that the information Avid had about a suspect would soon lead to an arrest.\n\nBut it did not, and now gigabytes of information have been released and no-one is any the wiser about who the hackers are, where they are located and why they attacked the site.\n\nThe group is technically pretty competent, according to independent security researcher The Grugq, who asked to remain anonymous.\n\n\"Ashley Madison seems to have been better protected than some of the other places that have been hit recently, so maybe the crew had a stronger skill set than normal,\" he told the BBC.\n\nThey have also shown that they are adept when it comes to sharing what they stole, said forensic security specialist Erik Cabetas in a detailed analysis of the data.\n\n    Nobody keeps something like this a secret\n    Erik Cabetas, Forensic security specialist\n\nThe data was leaked first via the Tor network because it is good at obscuring the location and identity of anyone using it. However, Mr Cabetas said the group had taken extra steps to ensure their dark web identities were not matched with their real-life identities.\n\nThe Impact Team dumped the data via a server that only gave out basic web and text data - leaving little forensic information to go on. In addition, the data files seem to have been pruned of extraneous information that could give a clue about who took them and how the hack was carried out.\nIdentifiable clues\n\nThe only potential lead that any investigator has is in the unique encryption key used to digitally sign the dumped files. Mr Cabetas said this was being employed to confirm the files were authentic and not fakes. But he said it could also be used to identify someone if they were ever caught.\n\nBut he warned that using Tor was not foolproof. High-profile hackers, including Ross Ulbricht, of Silk Road, have been caught because they inadvertently left identifiable information on Tor sites.\n\nThe Grugq has also warned about the dangers of neglecting operational security (known as opsec) and how extreme vigilance was needed to ensure no incriminating traces were left behind.\nRoss Ulbricht was arrested after failing to cover his tracks\n\n\"Most opsec mistakes that hackers make are made early in their career,\" he said. \"If they keep at it without changing their identifiers and handles (something that is harder for cybercriminals who need to maintain their reputation), then finding their mistakes is usually a matter of finding their earliest errors.\"\n\n\"I suspect they have a good chance of getting away because they haven't linked to any other identifiers. They've used Tor, and they've kept themselves pretty clean,\" he said. \"There doesn't seem to be anything in their dumps or in their missives that would expose them.\"\n\nThe Grugq said it would need forensic data recovered from Ashley Madison around the time of the attack to track them down. But he said that if the attackers were skilled they might not have left much behind.\n\n\"If they go dark and never do anything again (related to the identities used for AM) then they will likely never be caught,\" he said.\n\nMr Cabetas agreed and said they would probably be unearthed only if they spilled information to someone outside the group.\n\n\"Nobody keeps something like this a secret. If the attackers tell anybody, they're likely going to get caught,\" he wrote.",
        "updatedAt": "2015-08-21T16:04:43.227Z"
    }
] }